Config/Documents/ВедомостьНаВыплатуВБанк.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Document>
		<Properties>
			<Name>ВедомостьНаВыплатуВБанк</Name>
			<BasedOn>
				<xr:Item>Document.НачислениеКомпенсацииОбразование</xr:Item>
			</BasedOn>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИФО</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ИсточникиФинансовогоОбеспечения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КассовыйОрган</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Банки</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СуммаДокумента</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>18</v8:Digits>
							<v8:FractionDigits>2</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НастройкаВыгрузки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.НастройкиВыгрузкиКомпенсацииРодительскойПлаты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КраткийСоставДокумента</Name>
					<Comment>Краткий перечень получателей, включенных в документ</Comment>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СотрудникКонтрагент</Name>
					<Comment>0 - перечисление сотрудникам, 1 - контрагентам</Comment>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>1</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ГлБухгалтер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Руководитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДокументОснование</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.НачислениеКомпенсацииОбразование</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Ответственный</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НомерРеестра</Name>
					<Type>
						<v8:Type>xs:decimal</v8:Type>
						<v8:NumberQualifiers>
							<v8:Digits>10</v8:Digits>
							<v8:FractionDigits>0</v8:FractionDigits>
						</v8:NumberQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>КодВидаДохода</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>1</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВидЗачисления</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>2</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Состав</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>СчетСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПринятияОбязательства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>РасшифровкаПлатежа</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторСтроки</Name>
							<Type>
								<v8:Type>v8:UUID</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сотрудник</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>УдалитьСчетСотрудника</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.БанковскиеИКазначейскиеСчета</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КФО</Name>
							<Type>
								<v8:Type>cfg:EnumRef.КВД</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КПС</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КлассификационныеПризнакиСчетов</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КЭК</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.КОСГУ</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Сумма</Name>
							<Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>15</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодЦели</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦелевыхСредств</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>КодМероприятия</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Мероприятия</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДопКлассификация</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ДополнительнаяБюджетнаяКлассификация</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ОснованиеПринятияОбязательства</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Договоры</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

Config/InformationRegisters/ФИОФизическихЛиц.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ФИОФизическихЛиц</Name>
			<InformationRegisterPeriodicity>Day</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Фамилия</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Имя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Отчество</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>ФизическоеЛицо</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ФизическиеЛица</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/InformationRegisters/ДанныеСотрудников.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<InformationRegister>
		<Properties>
			<Name>ДанныеСотрудников</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Подразделение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Подразделения</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Должность</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Должности</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Звание</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>70</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>ВидДоговора</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыДоговоровССотрудниками</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>Сотрудник</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Config/Documents/ВедомостьНаВыплатуВБанк/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// См. УправлениеДоступомПереопределяемый.ПриЗаполненииСписковСОграничениемДоступа.
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
	"РазрешитьЧтениеИзменение
	|ГДЕ
	|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

// Создает элементы справочника ДокументыБИА для выгрузки информации в 1С:Архив.
// 
// Параметры:
//  СсылкаНаОбъектИсточник - ОпределяемыйТип.СсылкаНаОбъектИсточникБИА - ссылка на объект,
//   который нужно передать в 1С:Архив.
//
// Возвращаемое значение:
//  Массив из ДокументОбъект.ДокументыБИА - созданные документы.
//
Функция СоздатьДокументыБИА(СсылкаНаОбъектИсточник) Экспорт
	СформированныеДокументыБИА = Новый Массив;
	
	ОбменСАрхивомБГУ.СоздатьДокументыБИАДляДокументаУчета(СсылкаНаОбъектИсточник, СформированныеДокументыБИА);
	
	Возврат СформированныеДокументыБИА;
	
КонецФункции

#КонецОбласти

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру документа, используемую для формирования файла обмена, печатного документа
//
Функция ДанныеЗаполненияВедомости() Экспорт
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Документ", Документы.ВедомостьНаВыплатуВБанк.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("НомерДокумента", "");
	ДанныеЗаполнения.Вставить("НомерРеестра", "");
	ДанныеЗаполнения.Вставить("ДатаДокумента", Дата("00010101"));
	ДанныеЗаполнения.Вставить("ПолноеНаименованиеОрганизации", "");
	ДанныеЗаполнения.Вставить("Организация", Справочники.Организации.ПустаяСсылка());
	ДанныеЗаполнения.Вставить("РуководительДолжность", "");
	ДанныеЗаполнения.Вставить("Руководитель", "");
	ДанныеЗаполнения.Вставить("ГлавныйБухгалтерДолжность", "");
	ДанныеЗаполнения.Вставить("ГлавныйБухгалтер", "");
	ДанныеЗаполнения.Вставить("Заголовок", "");
	
	ДанныеЗаполнения.Вставить("Получатели", Новый Массив);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Возвращает структуру строки документа, используемую для формирования файла обмена, печатного документа
//
Функция ДанныеЗаполненияСтрокиВедомости() Экспорт
	
	ДанныеЗаполнения = Новый Структура();
	ДанныеЗаполнения.Вставить("Получатель", Неопределено);
	ДанныеЗаполнения.Вставить("НомерСтроки", 0);
	ДанныеЗаполнения.Вставить("Фамилия", "");
	ДанныеЗаполнения.Вставить("Имя", "");
	ДанныеЗаполнения.Вставить("Отчество", "");
	ДанныеЗаполнения.Вставить("НомерЛицевогоСчета", "");
	ДанныеЗаполнения.Вставить("СуммаКВыплате", 0);
	
	Возврат ДанныеЗаполнения;
	
КонецФункции

// Получает данные документа.
//
// Параметры:
//		МассивДокументов - Массив ссылок на документы, по которым требуется получить данные.
//		ДатаПолученияДанных - дата формирования файла.
//		ПлатежныйДокумент - Ссылка на платежный документ, в который входят ведомости.
//
// Возвращаемое значение:
//		Соответствие - где Ключ - ссылка на документ, Значение - структура документа
//
Функция ДанныеВедомостиНаВыплатуВБанк(МассивДокументов) Экспорт
	
	Запрос = Новый Запрос;
	
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВедомостьНаВыплатуВБанк.Ссылка КАК Ссылка,
	|	ВедомостьНаВыплатуВБанк.Номер КАК Номер,
	|	ВедомостьНаВыплатуВБанк.Дата КАК Дата,
	|	ВедомостьНаВыплатуВБанк.НомерРеестра КАК НомерРеестра,
	|	ВедомостьНаВыплатуВБанк.Организация КАК Организация,
	|	ВедомостьНаВыплатуВБанк.ГлБухгалтер КАК ГлБухгалтер,
	|	ВедомостьНаВыплатуВБанк.Руководитель КАК Руководитель,
	|	ВЫБОР
	|		КОГДА ВедомостьНаВыплатуВБанкСостав.Ссылка.СотрудникКонтрагент = 0
	|			ТОГДА ВедомостьНаВыплатуВБанкСостав.Сотрудник.Контрагент
	|		ИНАЧЕ ВедомостьНаВыплатуВБанкСостав.Контрагент
	|	КОНЕЦ КАК Контрагент,
	|	ВедомостьНаВыплатуВБанкСостав.СчетСотрудника.Код КАК НомерЛицевогоСчета,
	|	СУММА(ВедомостьНаВыплатуВБанкСостав.Сумма) КАК Сумма,
	|	МИНИМУМ(ВедомостьНаВыплатуВБанкСостав.НомерСтроки) КАК НомерСтроки,
	|	ВедомостьНаВыплатуВБанк.МоментВремени КАК МоментВремени
	|ПОМЕСТИТЬ ВТСписокФизическихЛиц
	|ИЗ
	|	Документ.ВедомостьНаВыплатуВБанк КАК ВедомостьНаВыплатуВБанк
	|		ЛЕВОЕ СОЕДИНЕНИЕ Документ.ВедомостьНаВыплатуВБанк.Состав КАК ВедомостьНаВыплатуВБанкСостав
	|		ПО ВедомостьНаВыплатуВБанк.Ссылка = ВедомостьНаВыплатуВБанкСостав.Ссылка
	|ГДЕ
	|	ВедомостьНаВыплатуВБанк.Ссылка В(&МассивДокументов)
	|
	|СГРУППИРОВАТЬ ПО
	|	ВедомостьНаВыплатуВБанк.Ссылка,
	|	ВедомостьНаВыплатуВБанк.Номер,
	|	ВедомостьНаВыплатуВБанк.Дата,
	|	ВедомостьНаВыплатуВБанк.Организация,
	|	ВедомостьНаВыплатуВБанк.ГлБухгалтер,
	|	ВедомостьНаВыплатуВБанк.Руководитель,
	|	ВЫБОР
	|		КОГДА ВедомостьНаВыплатуВБанкСостав.Ссылка.СотрудникКонтрагент = 0
	|			ТОГДА ВедомостьНаВыплатуВБанкСостав.Сотрудник.Контрагент
	|		ИНАЧЕ ВедомостьНаВыплатуВБанкСостав.Контрагент
	|	КОНЕЦ,
	|	ВедомостьНаВыплатуВБанкСостав.СчетСотрудника.Код,
	|	ВедомостьНаВыплатуВБанк.МоментВремени,
	|	ВедомостьНаВыплатуВБанк.НомерРеестра
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеРуководителя.Руководитель КАК Руководитель,
	|	ФИОФизическихЛиц.Фамилия КАК Фамилия,
	|	ФИОФизическихЛиц.Имя КАК Имя,
	|	ФИОФизическихЛиц.Отчество КАК Отчество,
	|	ДанныеСотрудников.Должность КАК Должность
	|ПОМЕСТИТЬ РуководителиФИО
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСписокФизическихЛиц.Руководитель КАК Руководитель,
	|		ВТСписокФизическихЛиц.Руководитель.Контрагент.ЮридическоеФизическоеЛицо КАК ФизЛицо,
	|		МАКСИМУМ(ФИОФизическихЛиц.Период) КАК ПериодФИО,
	|		МАКСИМУМ(ДанныеСотрудников.Период) КАК ПериодДолжность
	|	ИЗ
	|		ВТСписокФизическихЛиц КАК ВТСписокФизическихЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|			ПО (ФИОФизическихЛиц.Период <= ВТСписокФизическихЛиц.Дата)
	|				И ВТСписокФизическихЛиц.Руководитель.Контрагент.ЮридическоеФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|			ПО (ДанныеСотрудников.Период <= ВТСписокФизическихЛиц.Дата)
	|				И ВТСписокФизическихЛиц.Руководитель = ДанныеСотрудников.Сотрудник
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСписокФизическихЛиц.Руководитель,
	|		ВТСписокФизическихЛиц.Руководитель.Контрагент.ЮридическоеФизическоеЛицо) КАК ДанныеРуководителя
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ДанныеРуководителя.ПериодФИО = ФИОФизическихЛиц.Период
	|			И ДанныеРуководителя.ФизЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО ДанныеРуководителя.ПериодДолжность = ДанныеСотрудников.Период
	|			И ДанныеРуководителя.Руководитель = ДанныеСотрудников.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеРуководителя.Руководитель,
	|	ФИОФизическихЛиц.Имя,
	|	ФИОФизическихЛиц.Отчество,
	|	ФИОФизическихЛиц.Фамилия,
	|	ДанныеСотрудников.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеГлБухгалтера.ГлБухгалтер КАК ГлБухгалтер,
	|	ФИОФизическихЛиц.Фамилия КАК Фамилия,
	|	ФИОФизическихЛиц.Имя КАК Имя,
	|	ФИОФизическихЛиц.Отчество КАК Отчество,
	|	ДанныеСотрудников.Должность КАК Должность
	|ПОМЕСТИТЬ ГлБухгалтерыФИО
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСписокФизическихЛиц.ГлБухгалтер КАК ГлБухгалтер,
	|		ВТСписокФизическихЛиц.ГлБухгалтер.Контрагент.ЮридическоеФизическоеЛицо КАК ФизЛицо,
	|		МАКСИМУМ(ФИОФизическихЛиц.Период) КАК Период,
	|		МАКСИМУМ(ДанныеСотрудников.Период) КАК ПериодДолжность
	|	ИЗ
	|		ВТСписокФизическихЛиц КАК ВТСписокФизическихЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|			ПО (ФИОФизическихЛиц.Период <= ВТСписокФизическихЛиц.Дата)
	|				И ВТСписокФизическихЛиц.ГлБухгалтер.Контрагент.ЮридическоеФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|			ПО (ДанныеСотрудников.Период <= ВТСписокФизическихЛиц.Дата)
	|				И ВТСписокФизическихЛиц.ГлБухгалтер = ДанныеСотрудников.Сотрудник
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСписокФизическихЛиц.ГлБухгалтер,
	|		ВТСписокФизическихЛиц.ГлБухгалтер.Контрагент.ЮридическоеФизическоеЛицо) КАК ДанныеГлБухгалтера
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ДанныеГлБухгалтера.Период = ФИОФизическихЛиц.Период
	|			И ДанныеГлБухгалтера.ФизЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ДанныеСотрудников КАК ДанныеСотрудников
	|		ПО ДанныеГлБухгалтера.ПериодДолжность = ДанныеСотрудников.Период
	|			И ДанныеГлБухгалтера.ГлБухгалтер = ДанныеСотрудников.Сотрудник
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеГлБухгалтера.ГлБухгалтер,
	|	ФИОФизическихЛиц.Имя,
	|	ФИОФизическихЛиц.Отчество,
	|	ФИОФизическихЛиц.Фамилия,
	|	ДанныеСотрудников.Должность
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ДанныеКонтрагента.Контрагент КАК Контрагент,
	|	ФИОФизическихЛиц.Фамилия КАК Фамилия,
	|	ФИОФизическихЛиц.Имя КАК Имя,
	|	ФИОФизическихЛиц.Отчество КАК Отчество
	|ПОМЕСТИТЬ ФизическиеЛицаФИО
	|ИЗ
	|	(ВЫБРАТЬ
	|		ВТСписокФизическихЛиц.Контрагент КАК Контрагент,
	|		ВТСписокФизическихЛиц.Контрагент.ЮридическоеФизическоеЛицо КАК ФизЛицо,
	|		МАКСИМУМ(ФИОФизическихЛиц.Период) КАК Период
	|	ИЗ
	|		ВТСписокФизическихЛиц КАК ВТСписокФизическихЛиц
	|			ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|			ПО (ФИОФизическихЛиц.Период <= ВТСписокФизическихЛиц.Дата)
	|				И ВТСписокФизическихЛиц.Контрагент.ЮридическоеФизическоеЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|	
	|	СГРУППИРОВАТЬ ПО
	|		ВТСписокФизическихЛиц.Контрагент,
	|		ВТСписокФизическихЛиц.Контрагент.ЮридическоеФизическоеЛицо) КАК ДанныеКонтрагента
	|		ЛЕВОЕ СОЕДИНЕНИЕ РегистрСведений.ФИОФизическихЛиц КАК ФИОФизическихЛиц
	|		ПО ДанныеКонтрагента.Период = ФИОФизическихЛиц.Период
	|			И ДанныеКонтрагента.ФизЛицо = ФИОФизическихЛиц.ФизическоеЛицо
	|
	|СГРУППИРОВАТЬ ПО
	|	ДанныеКонтрагента.Контрагент,
	|	ФИОФизическихЛиц.Имя,
	|	ФИОФизическихЛиц.Отчество,
	|	ФИОФизическихЛиц.Фамилия
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ВТСписокФизическихЛиц.Ссылка КАК Документ,
	|	ВТСписокФизическихЛиц.Организация КАК Организация,
	|	ВТСписокФизическихЛиц.МоментВремени КАК МоментВремени,
	|	ВТСписокФизическихЛиц.Контрагент КАК Получатель,
	|	ВТСписокФизическихЛиц.НомерЛицевогоСчета КАК НомерЛицевогоСчета,
	|	ВТСписокФизическихЛиц.Сумма КАК СуммаКВыплате,
	|	ВТСписокФизическихЛиц.НомерСтроки КАК НомерСтроки,
	|	ФизическиеЛицаФИО.Фамилия КАК Фамилия,
	|	ФизическиеЛицаФИО.Имя КАК Имя,
	|	ФизическиеЛицаФИО.Отчество КАК Отчество
	|ИЗ
	|	ВТСписокФизическихЛиц КАК ВТСписокФизическихЛиц
	|		ЛЕВОЕ СОЕДИНЕНИЕ ФизическиеЛицаФИО КАК ФизическиеЛицаФИО
	|		ПО ВТСписокФизическихЛиц.Контрагент = ФизическиеЛицаФИО.Контрагент
	|ГДЕ
	|	НЕ ВТСписокФизическихЛиц.Контрагент ЕСТЬ NULL
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	МоментВремени,
	|	НомерСтроки
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ВедомостьНаВыплатуВБанк.Ссылка КАК Документ,
	|	ВедомостьНаВыплатуВБанк.Номер КАК НомерДокумента,
	|	ВедомостьНаВыплатуВБанк.Дата КАК ДатаДокумента,
	|	ВедомостьНаВыплатуВБанк.НомерРеестра КАК НомерРеестра,
	|	ВедомостьНаВыплатуВБанк.СотрудникКонтрагент КАК СотрудникКонтрагент,
	|	ВедомостьНаВыплатуВБанк.Организация КАК Организация,
	|	ВЫБОР
	|		КОГДА ВедомостьНаВыплатуВБанк.Организация.НаименованиеПолное = """"
	|			ТОГДА ВЫБОР
	|					КОГДА ВедомостьНаВыплатуВБанк.Организация.НаименованиеСокращенное = """"
	|						ТОГДА ВедомостьНаВыплатуВБанк.Организация.Наименование
	|					ИНАЧЕ ВедомостьНаВыплатуВБанк.Организация.НаименованиеСокращенное
	|				КОНЕЦ
	|		ИНАЧЕ ВедомостьНаВыплатуВБанк.Организация.НаименованиеПолное
	|	КОНЕЦ КАК ПолноеНаименованиеОрганизации,
	|	ВедомостьНаВыплатуВБанк.ГлБухгалтер КАК ГлБухгалтер,
	|	ВедомостьНаВыплатуВБанк.Руководитель КАК Руководитель,
	|	ВедомостьНаВыплатуВБанк.МоментВремени КАК МоментВремени,
	|	ЕСТЬNULL(РуководителиФИО.Должность.Наименование, """") КАК РуководительДолжность,
	|	РуководителиФИО.Фамилия КАК ФамилияРуководителя,
	|	РуководителиФИО.Имя КАК ИмяРуководителя,
	|	РуководителиФИО.Отчество КАК ОтчествоРуководителя,
	|	ГлБухгалтерыФИО.Фамилия КАК ФамилияГлБухгалтера,
	|	ГлБухгалтерыФИО.Имя КАК ИмяГлБухгалтера,
	|	ГлБухгалтерыФИО.Отчество КАК ОтчествоГлБухгалтера,
	|	ЕСТЬNULL(ГлБухгалтерыФИО.Должность.Наименование, """") КАК ГлавныйБухгалтерДолжность
	|ИЗ
	|	Документ.ВедомостьНаВыплатуВБанк КАК ВедомостьНаВыплатуВБанк
	|		ЛЕВОЕ СОЕДИНЕНИЕ РуководителиФИО КАК РуководителиФИО
	|		ПО ВедомостьНаВыплатуВБанк.Руководитель = РуководителиФИО.Руководитель
	|		ЛЕВОЕ СОЕДИНЕНИЕ ГлБухгалтерыФИО КАК ГлБухгалтерыФИО
	|		ПО ВедомостьНаВыплатуВБанк.ГлБухгалтер = ГлБухгалтерыФИО.ГлБухгалтер
	|ГДЕ
	|	ВедомостьНаВыплатуВБанк.Ссылка В(&МассивДокументов)
	|
	|УПОРЯДОЧИТЬ ПО
	|	Организация,
	|	МоментВремени";
	
	Запрос.УстановитьПараметр("МассивДокументов", МассивДокументов);
	
	РезультатыЗапроса = Запрос.ВыполнитьПакет();
	
	ДанныеДокументов = Новый Соответствие;
	
	ВыборкаДокументов = РезультатыЗапроса[РезультатыЗапроса.ВГраница()].Выбрать();
	ВыборкаСтрокДокументов = РезультатыЗапроса[РезультатыЗапроса.ВГраница()-1].Выбрать();
	
	Пока ВыборкаДокументов.Следующий() Цикл
		
		ДанныеДокумента = ДанныеЗаполненияВедомости();
		ЗаполнитьЗначенияСвойств(ДанныеДокумента, ВыборкаДокументов);
		
		ДанныеДокумента.Заголовок = ?(ВыборкаДокументов.СотрудникКонтрагент = 0,
			НСтр("ru = 'Список на зачисление денежных средств на счета сотрудников'"),
			НСтр("ru = 'Список на зачисление денежных средств на счета физических лиц'"));
		ДанныеДокумента.Руководитель = КорреспондентыКлиентСервер.ФИО(
			Новый Структура("Фамилия, Имя, Отчество", ВыборкаДокументов.ФамилияРуководителя, ВыборкаДокументов.ИмяРуководителя,
			ВыборкаДокументов.ОтчествоРуководителя), Истина);
		ДанныеДокумента.ГлавныйБухгалтер = КорреспондентыКлиентСервер.ФИО(
			Новый Структура("Фамилия, Имя, Отчество", ВыборкаДокументов.ФамилияГлБухгалтера, ВыборкаДокументов.ИмяГлБухгалтера,
			ВыборкаДокументов.ОтчествоГлБухгалтера), Истина);
		
		ВыборкаСтрокДокументов.Сбросить();
		Пока ВыборкаСтрокДокументов.НайтиСледующий(ВыборкаДокументов.Документ, "Документ") Цикл
			
			ДанныеСтрокиДокумента = ДанныеЗаполненияСтрокиВедомости();
			ЗаполнитьЗначенияСвойств(ДанныеСтрокиДокумента, ВыборкаСтрокДокументов);
			
			ДанныеДокумента.Получатели.Добавить(ДанныеСтрокиДокумента);
			ДанныеДокумента.Получатели[ДанныеДокумента.Получатели.Количество()-1].НомерСтроки = ДанныеДокумента.Получатели.Количество();
			
		КонецЦикла;
		
		ДанныеДокументов.Вставить(ДанныеДокумента.Документ, ДанныеДокумента);
		
	КонецЦикла;
	
	Возврат ДанныеДокументов;
	
КонецФункции

#КонецОбласти

#Область ПечатьДокумента

// Заполняет список команд печати.
// 
// Параметры:
//   КомандыПечати - ТаблицаЗначений - состав полей см. в функции УправлениеПечатью.СоздатьКоллекциюКомандПечати
//
Процедура ДобавитьКомандыПечати(КомандыПечати) Экспорт
	
	КомандаПечати = КомандыПечати.Добавить();
	//КомандаПечати.МенеджерПечати	= "Документ.ВедомостьНаВыплатуВБанк";
	КомандаПечати.Идентификатор		= "ПФ_MXL_СписокПеречислений";
	КомандаПечати.Представление		= НСтр("ru = 'Список перечислений'");
	//КомандаПечати.Порядок			= 1;
	
КонецПроцедуры

// Формирует печатные формы объектов
//
// Параметры
//   МассивОбъектов  - Массив    - Массив ссылок на объекты которые нужно распечатать
//   ПараметрыПечати - Структура - Структура дополнительных параметров печати
//   КоллекцияПечатныхФорм - Таблица значений - Сформированные табличные документы
//   ОбъектыПечати    - СписокЗначений   - Соответствие между объектами и именами печатных
//						областей, куда распечатан объект
//   ИменаМакетов    - Строка    - Имена макетов, перечисленные через запятую
//   ПараметрыВывода       - Структура        - Параметры сформированных табличных документов
//
Процедура Печать(МассивОбъектов, ПараметрыПечати, КоллекцияПечатныхФорм, ОбъектыПечати, ПараметрыВывода) Экспорт
	Если УправлениеПечатью.НужноПечататьМакет(КоллекцияПечатныхФорм, "ПФ_MXL_СписокПеречислений") Тогда
		// Формируем табличный документ и добавляем его в коллекцию печатных форм.
		
		УправлениеПечатью.ВывестиТабличныйДокументВКоллекцию(
			КоллекцияПечатныхФорм,
			"ПФ_MXL_СписокПеречислений",
			НСтр("ru = 'Список перечислений'"),
			ПечатьСпискаПеречисленийПоДокументам(МассивОбъектов, ОбъектыПечати));
			
	КонецЕсли;
КонецПроцедуры // Печать()

Функция ПечатьСпискаПеречисленийПоДокументам(МассивОбъектов, ОбъектыПечати) Экспорт
	
	ТабличныйДокумент = ПечатьСписокПеречислений(
		МассивОбъектов,
		ОбъектыПечати,
		ДанныеВедомостиНаВыплатуВБанк(МассивОбъектов));
	
	Возврат ТабличныйДокумент;
	
КонецФункции

Функция ПечатьСписокПеречислений(МассивОбъектов, ОбъектыПечати, ДанныеДляПечати)
	
	ТабличныйДокумент = Новый ТабличныйДокумент;
	ТабличныйДокумент.ИмяПараметровПечати = "ПАРАМЕТРЫ_ПЕЧАТИ_ВедомостьНаВыплатуВБанк_СписокПеречислений";
	
	Макет = УправлениеПечатью.МакетПечатнойФормы("Документ.ВедомостьНаВыплатуВБанк.ПФ_MXL_СписокПеречислений");
	
	ПервыйДокумент = Истина;
	
	Для Каждого ДанныеДокументаДляПечати Из ДанныеДляПечати Цикл
		
		ДанныеДокумента = ДанныеДокументаДляПечати.Значение;
		// Документы нужно выводить на разных страницах.
		Если Не ПервыйДокумент Тогда
			ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
		КонецЕсли;
		ПервыйДокумент = Ложь;
		
		// Запомним номер строки, с которой начали выводить текущий документ.
		НомерСтрокиНачало = ТабличныйДокумент.ВысотаТаблицы + 1;
		
		// Подсчитываем количество страниц документа - для корректного разбиения на страницы.
		ВсегоСтрокДокумента = ДанныеДокумента.Получатели.Количество();
		
		ОбластьМакетаШапкаДокумента = Макет.ПолучитьОбласть("ШапкаДокумента");
		ОбластьМакетаШапка			= Макет.ПолучитьОбласть("Шапка");
		ОбластьМакетаСтрока 		= Макет.ПолучитьОбласть("Строка");
		ОбластьМакетаИтогПоСтранице = Макет.ПолучитьОбласть("ИтогПоЛисту");
		ОбластьМакетаПодвал 		= Макет.ПолучитьОбласть("Подвал");
		
		// Массив с двумя строками - для разбиения на страницы.
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		
		// выводим данные о документе
		ОбластьМакетаШапкаДокумента.Параметры.Заполнить(ДанныеДокумента);
		ОбластьМакетаШапкаДокумента.Параметры.НомерРеестра = Формат(ДанныеДокумента.НомерРеестра, "ЧГ=");
		ОбластьМакетаШапкаДокумента.Параметры.Дата = Формат(ДанныеДокумента.ДатаДокумента, "ДЛФ=D");
		ОбластьМакетаШапкаДокумента.Параметры.Организация = СокрЛП(ДанныеДокумента.ПолноеНаименованиеОрганизации);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаШапкаДокумента);
		ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
		
		ВыведеноСтраниц = 1; ВыведеноСтрок = 0; ИтогоНаСтранице = 0; Итого = 0;
		
		// Выводим данные по строкам документа.
		Для Каждого ДанныеДляПечатиСтроки Из ДанныеДокумента.Получатели Цикл
			
			ОбластьМакетаСтрока.Параметры.НомерСтроки = ДанныеДляПечатиСтроки.НомерСтроки;
			ОбластьМакетаСтрока.Параметры.НомерЛицевогоСчета = ДанныеДляПечатиСтроки.НомерЛицевогоСчета;
			ОбластьМакетаСтрока.Параметры.Физлицо = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(
				НСтр("ru = '%1 %2 %3'"), ДанныеДляПечатиСтроки.Фамилия, ДанныеДляПечатиСтроки.Имя, ДанныеДляПечатиСтроки.Отчество);
			ОбластьМакетаСтрока.Параметры.Сумма = ДанныеДляПечатиСтроки.СуммаКВыплате;
			
			// разбиение на страницы
			ВыведеноСтрок = ВыведеноСтрок + 1;
			
			// Проверим, уместится ли строка на странице или надо открывать новую страницу.
			ВывестиПодвалЛиста = Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти);
			Если Не ВывестиПодвалЛиста И ВыведеноСтрок = ВсегоСтрокДокумента Тогда
				ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
				ВывестиПодвалЛиста = Не ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти);
			КонецЕсли;
			Если ВывестиПодвалЛиста Тогда
				
				ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
				ТабличныйДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
				ТабличныйДокумент.ВывестиГоризонтальныйРазделительСтраниц();
				ТабличныйДокумент.Вывести(ОбластьМакетаШапка);
				ВыведеноСтраниц = ВыведеноСтраниц + 1;
				ИтогоНаСтранице = 0;
				
			КонецЕсли;
			
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
			ИтогоНаСтранице = ИтогоНаСтранице + ДанныеДляПечатиСтроки.СуммаКВыплате;
			Итого = Итого + ДанныеДляПечатиСтроки.СуммаКВыплате;
			
		КонецЦикла;
		
		Если ВыведеноСтрок > 0 Тогда 
			ОбластьМакетаИтогПоСтранице.Параметры.ИтогоНаСтранице = ИтогоНаСтранице;
		КонецЕсли;
		
		// строка-пустышка
		Для Сч = 1 По ОбластьМакетаСтрока.Параметры.Количество() Цикл
			ОбластьМакетаСтрока.Параметры.Установить(Сч - 1,""); 
		КонецЦикла;
		ОбластьМакетаСтрока.Параметры.Физлицо = " ";
		
		ОбластьМакетаПодвал.Параметры.Заполнить(ДанныеДокумента);
		ОбластьМакетаПодвал.Параметры.Итого = Итого;
		
		// дополняем пустыми строками до конца страницы
		ВыводимыеОбласти = Новый Массив();
		ВыводимыеОбласти.Добавить(ОбластьМакетаСтрока);
		ВыводимыеОбласти.Добавить(ОбластьМакетаИтогПоСтранице);
		ВыводимыеОбласти.Добавить(ОбластьМакетаПодвал);
		Пока ОбщегоНазначения.ПроверитьВыводТабличногоДокумента(ТабличныйДокумент, ВыводимыеОбласти) Цикл
			ТабличныйДокумент.Вывести(ОбластьМакетаСтрока);
		КонецЦикла;
		
		ТабличныйДокумент.Вывести(ОбластьМакетаИтогПоСтранице);
		
		ТабличныйДокумент.Вывести(ОбластьМакетаПодвал);
		
		// В табличном документе необходимо задать имя области, в которую был 
		// выведен объект. Нужно для возможности печати покомплектно.
		УправлениеПечатью.ЗадатьОбластьПечатиДокумента(ТабличныйДокумент, НомерСтрокиНачало, ОбъектыПечати, ДанныеДокумента.Документ);
		
	КонецЦикла; // по документам
	
	Возврат ТабличныйДокумент;
	
КонецФункции

#КонецОбласти

#КонецЕсли
